[
    {
        "_id": "5c3379848f74fb6456462c64",
        "slug": "what-is-the-benefit-of-this-meditation",
        "eid": "f15ea111-07d3-4dc4-b338-96679b66a982",
        "title": {
            "en": "What is the benefit of this meditation?"
        },
        "answer": {
            "en": "<ul><li>Where is the need to meditate, first of all? Starting the process of life was not your conscious choice, it “happened” to you. When you were born your body was so small, and now it has grown. So obviously, the body is something that you gathered. It is an accumulation. What you call as “my body” is an accumulation of food. Similarly, what you call as “my mind” is an accumulation of impressions.</li><li>Whatever you accumulate can be yours, but it can never be you. The very fact you accumulated it means that you gathered it from somewhere else. Today you could gather a 70 kg body, but you can decide to make it a 60 kg body. You don’t go looking for that 10 kg, because that was an accumulation. Once you drop it, it is gone. Similarly, your mind is an accumulation of impressions.</li><li>The moment you are identified in your experience, the moment you are identified with something that you are not, your perception gets distorted. The moment you start experiencing this body, which you gathered from outside, as “myself,” the moment you start experiencing the impressions that you have in your mind as “myself,” you cannot perceive life the way it is. You will only perceive life the way it is necessary for your survival and not the way it really is.</li><li>Once you have come as a human being, survival is very important, but it is not enough. If you had come here like any other creature on this planet, stomach full – life would be settled. But once you come here as a human being, life does not end with survival. Actually, for a human being, life begins only after survival is fulfilled.</li><li>Meditation gives you an experience, an inner state, where what is you and what is yours is separated. There is a little distance, there is a little space between what is you and what you have accumulated. For now we can understand this as meditation.</li><li>What is the use of doing this? It brings an absolute clarity of perception. You see life just the way it is – no distortions about it. Right now, your ability to go through this world is only to the extent that you clearly see it. If I have no clarity of vision but confidence and I try to go through this world, I am going to be a bumbling idiot. Whenever there is no perception, people try to overcome that by building confidence in themselves. People are trying to make up for the lack of clarity with other kinds of substitutes. There is no substitute for clarity.</li><li>Once you understand this, you naturally become meditative; you want to clear up everything and just look at life the way it is, because you want to walk through life with the least amount of friction, without stumbling on this or that.</li></ul><p><br></p>"
        },
        "category_eid": "cbd43e8e-0b0b-480a-8dbd-dd2795b9a468",
        "__v": 0,
        "_active": true,
        "updated_at": "2019-01-07T16:08:36.444Z",
        "created_at": "2019-01-07T16:08:36.444Z"
    },
    {
        "_id": "5c3379928f74fb6456462c6c",
        "slug": "what-exactly-does-this-meditation-do",
        "eid": "7cb0b833-c224-4486-bfea-9c8962fc8608",
        "title": {
            "en": "What exactly does this meditation do?"
        },
        "answer": {
            "en": "<ul><li>This kriya will create a certain space between you and your body, between you and your mind. If at all there is any struggle in your life, it is because you identify yourself with these limited aspects of yourself.</li><li>So the essence of meditation is that it creates a space, a distance between you and what you refer to as your “mind.” All the suffering you go through is manufactured in your mind. If you distance yourself from the mind, can there be suffering in you? This is the end of suffering.</li><li>Now while you are meditating, there is a distance between you and your mind, and you do feel peaceful. The problem is that the moment you open your eyes, you are again stuck with your mind.</li><li>If you meditate every day, a day will come when you open your eyes, and you can still experience that the mind is there and you are here. This is the end of suffering. When you are no longer identified with your body and mind, you will be in touch with the source of creation within you. Once this happens, Grace happens.</li><li>That means your whole karmic bag – your past or unconscious mind – has been kept aside. It cannot have any influence over you. Once the past has no influence over you, life becomes a huge potential.</li><li>Every breath becomes such a tremendous possibility in your life, because the past is not playing any role in your existence here now. If you sit here, you are absolute life. Life becomes effortless.</li></ul><p><br></p>"
        },
        "category_eid": "cbd43e8e-0b0b-480a-8dbd-dd2795b9a468",
        "__v": 0,
        "_active": true,
        "updated_at": "2019-01-07T16:08:50.063Z",
        "created_at": "2019-01-07T16:08:50.062Z"
    },
    {
        "_id": "5c3379a18f74fb6456462c74",
        "slug": "what-is-the-minimum-age-required-for-doing-the-isha-kriya",
        "eid": "302cf442-8f2e-406a-bca1-d7e156a78808",
        "title": {
            "en": "What is the minimum age required for doing the Isha Kriya?"
        },
        "answer": {
            "en": "<ul><li>Anyone above 12 years of age can practice Isha Kriya.</li></ul>"
        },
        "category_eid": "cbd43e8e-0b0b-480a-8dbd-dd2795b9a468",
        "__v": 0,
        "_active": true,
        "updated_at": "2019-01-07T16:09:05.561Z",
        "created_at": "2019-01-07T16:09:05.560Z"
    },
    {
        "_id": "5c3379ac8f74fb6456462c7c",
        "slug": "why-is-this-being-offered-online",
        "eid": "d1dd87a7-32bb-44f8-999c-cd35c444ec8b",
        "title": {
            "en": "Why is this being offered online?"
        },
        "answer": {
            "en": "<ul><li>A few years ago, I simply sat down and overflowed with ecstasy, without attempting anything, and for no reason. I thought, ‘What's the big deal? Just sitting here, I am bursting with ecstasy. What’s the big deal? I am going to make the whole world ecstatic.’ It has been almost thirty years now, and I became like this (<em>Refers to his beard</em>) but people have not given up their misery. We have touched a few million people, but that’s not the whole world. My idea of the world is seven billion people.</li><li>Right now societies are getting freakier by the day because everything that one could do materially has been done. Now they don’t know what to do. All you can do is cut your hair or tattoo your body from head to toe. What other new thing can you do? People will start doing more and more life negative things, just because they want to do something new.</li><li>So society is overripe for spiritual process; it is overripe. If you don’t provide it now, it’ll burst. You have to provide a large scale,&nbsp;<em>non-religious spiritual process which does not ascribe to any particular philosophy or ideology</em>&nbsp;- just a simple process, which will turn them inward. Till now, maybe in small patches here and there, people have been touched, but it has not happened on a large-scale. Today with the technology available, we can make this happen.</li><li>This will be the most important thing that we as a generation of people can do. To have the privilege to do something large-scale for human consciousness.</li><li>If you do too much of external engineering, we will not have a planet left. It is time that human energies are turned inward so that they can engineer themselves and not cause any damage to the outside. There is lot of work to do inside. If we don't open that dimension on a large scale to the effervescent, very industrious societies on the planet, their industry will destroy the planet.</li></ul><p><br></p>"
        },
        "category_eid": "cbd43e8e-0b0b-480a-8dbd-dd2795b9a468",
        "__v": 0,
        "_active": true,
        "updated_at": "2019-01-07T16:09:16.940Z",
        "created_at": "2019-01-07T16:09:16.938Z"
    },
    {
        "_id": "5c3379b88f74fb6456462c84",
        "slug": "what-is-the-importance-of-the-breath-is-there-more-to-breathing-well-than-positive-health-effects",
        "eid": "bdd48b33-2627-4de7-90f7-8b6b6228e7af",
        "title": {
            "en": "What is the importance of the breath? Is there more to breathing well than positive health effects?"
        },
        "answer": {
            "en": "<ul><li>Breath is the thread which ties you to the body. If I take away your breath, you and your body will fall apart. It is the breath that has tied you to the body. What you call as your body and what you call as “me” have been tied together with breath. And this breath decides many aspects of who you are right now.</li><li>For different levels of thought and emotion that you go through, your breath takes on different types of patterns. If you are angry, you will breathe one way. You are peaceful, you breathe another way. You are happy, you breathe another way. You are sad, you will breathe another way. Have you noticed this?</li><li>Based on this, conversely, is the science of pranayama and kriya: by consciously breathing in a particular way, the very way you think, feel, understand and experience life can be changed.</li><li>This breath can be used in so many ways as a tool to do other things with the body and the mind. You will see with the Isha Kriya, we are using a simple process of breath, but the kriya itself is not in the breath. The breath is just a tool. The breath is an induction, but what happens is not about the breath.</li><li>Whichever way you breathe, that is the way you think. Whichever way you think, that is the way you breathe. Your whole life, your whole unconscious mind is written into your breath. If you just read your breath, your past, present and future is written there, in the way you breathe.</li><li>Once you realize this, life becomes very different. It needs to be known experientially; it is not something that you can propound. If you know the bliss of simply sitting here, the blissfulness of just being able to simply sit here, not thinking anything, not doing anything, simply sitting here, just being life, then life would be very different.</li><li>In a way, what this means is… Today, there is scientific proof that without taking a drop of alcohol, without taking any substance you can simply sit here and get drugged or stoned or drunk by yourself – no hangover. If you are aware in a certain way, you can activate the system in such a way that if you sit here, it is an enormous pleasure. Once simply sitting and breathing is such a great pleasure, you will become very genial, flexible, wonderful – because all the time you are in a great state within yourself. The mind becomes sharper than ever before.</li></ul><p><br></p>"
        },
        "category_eid": "cbd43e8e-0b0b-480a-8dbd-dd2795b9a468",
        "__v": 0,
        "_active": true,
        "updated_at": "2019-01-07T16:09:28.016Z",
        "created_at": "2019-01-07T16:09:28.016Z"
    }
]