[
    {
        "_id": "5bdde865168777433cf3488e",
        "slug": "How-To-Deal-With-Anxiety-When-Meeting-People",
        "eid": "71dc8419-6ee9-42b5-a8e2-2f8a490afc01",
        "title": {
            "en": "How To Deal With Anxiety When Meeting People?"
        },
        "subtitle": {
            "en": "How To Deal With Anxiety When Meeting People?"
        },
        "body": {
            "en": "<p><strong><em>Question:&nbsp;</em></strong><em>I feel very anxious to open up with people whenever I meet someone. Is it some mental issue or is it that I just don’t fit into society? What do I do?</em></p><p><strong>Sadhguru</strong>: You would have definitely heard of a word called “yoga.” When I say “yoga” people immediately think of twisting the body into some posture. No, the word&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/what-is-yoga\" target=\"_blank\">yoga</a>&nbsp;means “union.” In your perception of life there is you and there is the world. So it is you versus the universe actually. You versus the universe is a bad competition to get into. Do you think you have any chance of winning this competition? Don’t compete with the universe.&nbsp;</p><p>&nbsp;</p><p>This is why we found a way called yoga. Yoga or union means you consciously&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/sadhguru-spot/obliterating-boundaries\" target=\"_blank\">obliterate the boundaries of your individuality</a>, so there is no such thing as you and the universe – it feels like one. You need to do a little yoga, otherwise your mind will get twisted out with all kinds of ideas, emotions and opinions.&nbsp;</p><p class=\"ql-align-right\">There is a whole science and technology called yoga, which approaches how to handle your body, chemistry, mental fluctuations and energies. If you bring this to a certain level, whoever comes, you are at ease.</p><p>If you open it up a little bit, if you obliterate the boundaries of your individuality, it becomes very easy because when you sit here you see the other person as a part of yourself. You have no problem whether it is a man, woman, child or an animal. You will&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/communication-key-life\" target=\"_blank\">communicate</a>&nbsp;with everything absolutely because you have opened up your boundaries. It is only when you have concretized your boundaries that you will always have a problem. If it is a man, there is one kind of problem. If it is a woman, there is another kind of problem.&nbsp;</p><p>It is time you work upon bringing yourself to ease – not only with other people, just with life. The life that you are must be at ease. If you are not at ease, you will never&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/most-important-things-in-life\" target=\"_blank\">realize your full potential</a>.&nbsp;</p><p>&nbsp;</p><p>There is a certain genius in every individual. But ninety-nine percent of the people live and die without ever opening up the genius within themselves. If it has to open up, if the true potential within you has to open up, your life should come to ease.&nbsp;</p><p><br></p><p>There is a whole science and technology called yoga, which approaches how to handle your body, chemistry, mental fluctuations and energies. If you bring this to a certain level, whoever comes, you are at ease. In agitation, everything is distorted. So, being at ease is most important, otherwise you will not experience life the way it is.&nbsp;</p>"
        },
        "photo": {
            "en": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/71dc8419-6ee9-42b5-a8e2-2f8a490afc01/cover.en.jpeg"
        },
        "caption": {
            "en": "Oct 19, 2018"
        },
        "photo_credit": {
            "en": ""
        },
        "author_eid": "e1253e86-70e3-4880-857e-14122e83c772",
        "fields": {
            "tag": "news"
        },
        "notify": "false",
        "status": "published",
        "links": [],
        "custom_module_eid": "4c910efb-0693-4e2b-aaab-916b12dc4108",
        "__v": 0,
        "_active": true,
        "updated_at": "2018-11-03T18:26:45.903Z",
        "created_at": "2018-11-03T18:26:45.808Z"
    },
    {
        "_id": "5bdde8b0168777433cf3489c",
        "slug": "Deal-with-the-Karmic-Mountain-Around-You",
        "eid": "77d54bfe-a6d2-4089-8ee8-fe49635553ef",
        "title": {
            "en": "Deal with the Karmic Mountain Around You"
        },
        "subtitle": {
            "en": "Sadhguru looks at how we build a mountain of karma around us, and what we need to do to dismantle this."
        },
        "photo": {
            "en": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/77d54bfe-a6d2-4089-8ee8-fe49635553ef/cover.en.jpeg"
        },
        "photo_credit": {
            "en": "Nov 2, 2018"
        },
        "body": {
            "en": "<p><strong>Sadhguru:&nbsp;</strong>Shankaran Pillai boarded a local bus. Suddenly, he covered his face with a shawl and doubled up. A puzzled co-passenger asked him, “Sir, are you all right?” Shankaran Pillai assured him that he was all right, and said, “It’s just that if I see that old lady there, I would have to offer her my seat. I’m crouching to avoid seeing her.”Shankaran Pillai’s choice was either to stand and offer his seat, or continue sitting. But most people try to avoid involvement of various kinds, never realising that avoidance is big karma. The moment you try to shun involvement, karma multiplies. And the calculation – “Should I give up my seat or not” – is an even bigger karma.</p><p><br></p><p><br></p><p>&nbsp;</p><p>How does one escape this entanglement-avoidance trap? This question confuses many. In a state of confusion, everything around you sticks to you! It is like you are covered by a super-glue coating, and every speck of dust adheres.&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/karma-on-record\" target=\"_blank\">Acquiring karma</a>&nbsp;has nothing to do with performing good or bad deeds. You simply build karma within yourself with confused intentions and limited desires. After some time, you have such a mountain of karma around you that it becomes difficult to breathe.&nbsp;</p><p class=\"ql-align-right\">Human desire can be limited or boundless. If you choose boundless desire, that is the end of karma.</p><p>How can one ever dismantle this enormous karmic mountain? The answer is simple: you don’t try to dismantle it.&nbsp;You just wash off the glue.<em>&nbsp;</em>The entire mountain will fall apart in an instant. How is this adhesive removed? Not through avoidance, but through conscious involvement. With conscious involvement, there is no possibility of ever getting stuck again.&nbsp;</p><p>Human desire can be limited or boundless. If you choose boundless desire, that is the end of karma. Alternatively, if you rise above your likes and dislikes, your narrow ideas of “mine” and “not mine”, that is the end of karma. Make your desire inclusive, make everything yours, become a mother to the world, and the possibility of being stuck vanishes forever.</p><p class=\"ql-align-right\">The whole system of yoga is to cultivate a profound sense of involvement without any specific intention or motive.</p><p>The ultimate aim of the&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/a-rollercoaster-life\" target=\"_blank\">spiritual path</a>&nbsp;is dispassionate involvement and unwavering focus. It does not matter what you are involved with or focused on: God, a rock, a man or a woman. The object of focus is unimportant. The&nbsp;<em>Akashi mudra</em>&nbsp;practice in the yogic tradition entails focussing on nothing at all; it is simply an unwavering focus on empty space. The premise is that liberation does not depend on the object of your focus, but the focus itself.</p><p>The whole system of yoga is to cultivate a profound sense of involvement without any specific intention or motive. Over time, this was misunderstood to mean aloofness: people confused involvement with entanglement and dispassion with indifference. What they forgot – and as Shankaran Pillai found out on that bus – is that ignoring someone also needs a lot of involvement!</p><p class=\"ql-align-right\">It is the journey of inclusion that liberates you, not the destination. In exclusion, you become trapped. In inclusion, you are liberated.</p><p>Since life itself is a process without purpose, it is only in absolute involvement in the process that the juice of life can be tasted. Process&nbsp;is<em>&nbsp;</em>the purpose; the goal just a consequence. And it was to simplify things that so many ancient traditions spoke of “devotion”.&nbsp;</p><p>There is nothing sentimental about devotion. If the fire of genuine devotion burns within you, it will burn up everything. It will ensure you are absolutely committed to the process without worrying about what the goal is. It is the journey of inclusion that liberates you, not the destination. In exclusion, you become trapped. In inclusion, you are liberated.</p>"
        },
        "author_eid": "e1253e86-70e3-4880-857e-14122e83c772",
        "fields": {
            "tag": "news"
        },
        "notify": "false",
        "status": "published",
        "links": [],
        "custom_module_eid": "4c910efb-0693-4e2b-aaab-916b12dc4108",
        "__v": 0,
        "_active": true,
        "updated_at": "2018-11-03T18:28:00.391Z",
        "created_at": "2018-11-03T18:28:00.310Z"
    },
    {
        "_id": "5bdde8fc168777433cf348a5",
        "slug": "Devi-Worship-in-India-and-Around-the-World",
        "eid": "43cd5aee-832f-46b9-91f4-b29d2107ee4a",
        "title": {
            "en": "Devi Worship in India and Around the World"
        },
        "subtitle": {
            "en": "Sadhguru looks at how the worship of the feminine has largely disappeared today, but explains that there are still many powerful, intricately consecrated spaces in India."
        },
        "photo": {
            "en": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/43cd5aee-832f-46b9-91f4-b29d2107ee4a/cover.en.jpeg"
        },
        "body": {
            "en": "<p><em>Experience Devi live this 2018 Navratri on October 12, 14 and 17, as we live stream the Navratri Pooja at 5:30 PM IST on Linga Bhairavi&nbsp;</em><a href=\"https://www.facebook.com/Linga.Bhairavi/\" target=\"_blank\"><em>Facebook</em></a><em>&nbsp;and Youtube channels.</em></p><p><strong><em>Q:&nbsp;</em></strong><em>How important is feminine energy to our planet today?</em></p><p><strong>Sadhguru:&nbsp;</strong>The worship of the feminine was prevalent right across the planet at one time. But unfortunately, a very ambitious approach to religion became the mode. When conquest became the mode, people&nbsp;<a href=\"http://isha.sadhguru.org/blog/video/feminine-worship-almost-disappeared-today/\" target=\"_blank\">burnt the feminine</a>&nbsp;off the planet. And today, the masculine is the only way to be successful; we have even compelled women to become very masculine in their attitude, approach and emotion. We have made everyone believe that conquest is the only way to success.But to conquer is not the way; to embrace is the way. Trying to conquer the planet has led to all the disasters we see today. If the feminine were the more dominant factor, or if masculine and feminine were evenly balanced, I don’t think we would have&nbsp;<a href=\"http://isha.sadhguru.org/blog/video/project-greenhands-ecology-and-the-fundamental-identity/\" target=\"_blank\">ecological disasters</a>&nbsp;because worship of the feminine and the earth always went together. Cultures that looked upon the&nbsp;<a href=\"http://isha.sadhguru.org/blog/social-impact/environment/you-are-the-earth/\" target=\"_blank\">earth</a>&nbsp;as Mother have never caused much damage to the environment around them; damage only happened when conquest was seen as the way of life.</p><p><br></p><p><br></p><p>Right now, even after all this damage to the planet, half the people still can’t even eat properly though there is enough food on the planet. If the feminine were dominant, the population would definitely eat, and compassion, love and aesthetics would be dominant. Instead, we chose the power of gross conquest over the subtleties of love and compassion. We chose to conquer life rather than embrace it. If the feminine were dominant, perhaps we would not have gone to the Moon or to&nbsp;<a href=\"http://isha.sadhguru.org/blog/sadhguru/spot/by-curiosity-or-conquest/\" target=\"_blank\">Mars</a>, but what have we really achieved by going there? We placed a flag, left a footprint and came down. What is the significance? The whole&nbsp;<a href=\"http://isha.sadhguru.org/blog/sadhguru/spot/creatures_o/\" target=\"_blank\">romance of the moon</a>&nbsp;is now gone.</p><p>Our whole attitude towards life has become lopsided. I am not against scientific achievements, but we have lost the life-orientation of science. For most people, science and technology is only about using everything on the planet for our benefit. This attitude of exploiting everything is a very conquest-oriented, masculine approach. If the&nbsp;<a href=\"http://isha.sadhguru.org/blog/video/day-of-the-feminine-sadhguru-on-international-womens-day/\" target=\"_blank\">masculine and the feminine</a>&nbsp;were evenly balanced, we would have lived much better lives.</p><h2>Devi Temples in India</h2><p><br></p><p><br></p><p>Feminine worship is the most ancient form of worship on the planet. India, Europe, Arabia, and large parts of Africa were involved in goddess worship. But today, because of too much emphasis on the masculine worldwide, the only culture that still has feminine worship is India.</p><p class=\"ql-align-right\">If masculine and feminine were evenly balanced, I don’t think we would have ecological disasters because worship of the feminine and the earth always went together.</p><p>Just before the&nbsp;<a href=\"http://isha.sadhguru.org/mystic/dhyanalinga/consecration-process/triangular-form/\" target=\"_blank\">Dhyanalinga consecration</a>, I went on a tour of Devi temples with a small group of people. At that time, I was not geographically very conversant with Tamil Nadu, so I chose to go to Karnataka because I know where the temples are. These are not the famous temples, but little temples in small towns and villages. I have known this from the past so we went in search of them because we wanted to settle certain things and we were looking for the right kind of space and energy to do it in. We could have created that at the Isha Yoga Center, but it would mean building a shrine and maintaining the space continuously. We were yet to consecrate the Dhyanalinga, so we did not want to go in for another temple to do these things.</p><p>We went in search of these temples and I was absolutely amazed. In little towns, sometimes even in little villages, Devi temples that were consecrated hundreds of years ago are still very alive – fully, forcefully and fiercely alive. Most of these temples were created for a specific purpose, for the requirements of that local area. Whoever did this, did it very well. The technology was very good and if it had to happen in so many places, obviously it was very widespread and well-known to people. It was very humbling to see that in a tiny village, someone had consecrated something that involved a very great amount of sophistication. These were nameless yogis. No one knows who those people are. They did not write their names on the temple, and that is the beauty of it – they didn't even think it was necessary for them to leave their name. This energy that they left is all.</p><p><br></p>"
        },
        "photo_credit": {
            "en": "Oct 15, 2018"
        },
        "author_eid": "e1253e86-70e3-4880-857e-14122e83c772",
        "fields": {
            "tag": "news"
        },
        "notify": "false",
        "status": "published",
        "links": [],
        "custom_module_eid": "4c910efb-0693-4e2b-aaab-916b12dc4108",
        "__v": 0,
        "_active": true,
        "updated_at": "2018-11-03T18:29:16.772Z",
        "created_at": "2018-11-03T18:29:16.667Z"
    },
    {
        "_id": "5bdde96f168777433cf348ac",
        "slug": "Do-People-in-the-Northeast-Feel-Alienated-From-the-Rest-of-India",
        "eid": "6de9ab1a-350a-453c-b428-546eef3df84a",
        "title": {
            "en": "Do People in the Northeast Feel Alienated From the Rest of India?"
        },
        "subtitle": {
            "en": "Sadhguru answers a question on whether and why people in the Northeast feel alienated from the rest of the country, and gives us a brief history, since Independence, of development in this part of India."
        },
        "photo": {
            "en": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/6de9ab1a-350a-453c-b428-546eef3df84a/cover.en.jpeg"
        },
        "body": {
            "en": "<p><strong><em>Question:&nbsp;</em></strong><em>Why do people in Northeast India feel alienated from the rest of India?</em></p><p><strong>Sadhguru:&nbsp;</strong>We must understand a little bit about the context and history. After Independence, when decisions and plans were being made for the&nbsp;<a href=\"http://northeasttourism.gov.in/\" target=\"_blank\">Northeast</a>, Jawaharlal Nehru was advised not to touch the pristine nature and tribal cultures of the region.</p><p><br></p><p>&nbsp;</p><p>Initially, it was a conscious decision not to touch the&nbsp;<a href=\"http://www.walkthroughindia.com/location/north-east-india-an-unexplored-slice-of-paradise/\" target=\"_blank\">Northeast</a>&nbsp;because the people were living well in their own ecosystems. There was no need to bring cars, trains and airplanes and make them like the rest of the world. They were doing great by themselves. Today, the only country which has made a conscious decision like this and successfully implemented it is probably Bhutan.</p><p><br></p><p>&nbsp;</p><p>The original intention was not to disturb the tribal culture and natural surroundings. But after about twenty years, when they saw people were aspiring for something else, they should have changed the plan – but changing plans takes a long time in India. Because of that, development started happening in unplanned ways.</p><p><br></p><p>Youth and Truth in Meghalaya where Earth meets the Sky. Delighted to be in North East &amp; with the wonderful students of NEHU. -Sg </p><p>And today, because of connectivity, everyone is seeing big cities like New York and London on the television and Internet without having gone there. Everyone has succumbed to the Western ways of life and they think we also have to become like that. The government has decided to put railways, airways, roadways and everything in the Northeast in the next 15-20 years. Once that happens, the rest of&nbsp;</p><p>I<a href=\"https://isha.sadhguru.org/wisdom/article/india-everywhere-what-makes-india-india\" target=\"_blank\">ndia</a> will be driving all over the Northeast.&nbsp;</p><p class=\"ql-align-right\">Things are changing, so I don’t think the Northeast will feel alienated in another five years. There will be people all over the place.</p><p>This year, I went to Ladakh and Siachen for the&nbsp;<a href=\"https://isha.sadhguru.org/events/annual-events/international-yoga-day\" target=\"_blank\">International Day of Yoga</a>. It was unbelievable to see thousands of motorcycles everywhere. It is no more the pristine Ladakh that it was. The roads were full of tourists and there were traffic jams on the mountains, which was unheard of a few years ago.</p><p>&nbsp;</p><p>Things are changing, so I don’t think the Northeast will feel alienated in another five years. There will be people all over the place. These are not going to be wildlife enthusiasts or something – just picnickers everywhere. That is going to happen because the people chose development. We can think it is development, but it is also a certain loss to the country.</p><p><strong><em>Editor's Note:&nbsp;</em></strong><em>Sadhguru looks at the past, present and future of this nation, and explores why this culture matters to every human being on the planet. With images, graphics and Sadhguru’s inspiring words, here’s Bharat as you have never known it!</em></p><p class=\"ql-align-center\"><br></p>"
        },
        "author_eid": "e1253e86-70e3-4880-857e-14122e83c772",
        "fields": {
            "tag": "news"
        },
        "notify": "false",
        "status": "published",
        "links": [],
        "custom_module_eid": "4c910efb-0693-4e2b-aaab-916b12dc4108",
        "__v": 0,
        "_active": true,
        "updated_at": "2018-11-03T18:31:11.808Z",
        "created_at": "2018-11-03T18:31:11.537Z"
    },
    {
        "_id": "5bdde9c2168777433cf348b3",
        "slug": "How-Do-You-Make-Big-Decisions-You-Wont-Regret-Later",
        "eid": "d20a72a2-79f8-4d41-8ad1-7be9ac40ec56",
        "title": {
            "en": "How Do You Make Big Decisions You Won’t Regret Later"
        },
        "subtitle": {
            "en": "Sadhguru answers a question on how we can figure out which direction we should invest our time and energies in life."
        },
        "photo": {
            "en": "https://quickseries-dev.s3.amazonaws.com/qsapi-files/files/d20a72a2-79f8-4d41-8ad1-7be9ac40ec56/cover.en.jpeg"
        },
        "photo_credit": {
            "en": "Oct 22, 2018"
        },
        "body": {
            "en": "<p><strong><em>Question:&nbsp;</em></strong><em>What should I consider before taking big decisions in life?</em></p><p><strong>Sadhguru</strong>: Essentially, what you are asking is what you should invest your life in. Do not think in terms of what job to take or what education to do. The important thing is this life. For everyone, their life is precious. Into what do you want to invest this precious life? If you look at it this way, you will find something truly worthwhile to do. If you think in terms of how to earn a living and how to get something, you will do something silly that you will regret for the rest of your life.&nbsp;</p><p>&nbsp;</p><p>Most people are a regret, which is why they are going around joylessly – they are not doing what they want to do. Instead of creating what really matters to them, they are doing something for a living. Every creature, worm, insect, bird and animal is earning their living. Earning a living is not a big deal for a human being. Unfortunately, because of ten to twenty generations of&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/video/solution-for-poverty\" target=\"_blank\">poverty in this country</a>, people have gotten into this mode. Parents are constantly grilling their children about how they will earn their living. When an earthworm can earn its living, is earning a living an issue for a human being with such a big brain?&nbsp;</p><p><br></p><p>The question is about what you are going to create because what you call as your life is just a certain amount of&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/article/life-death-time-energy-information\" target=\"_blank\">time and energy</a>. This energy that you call as your life, how are you going to invest it? If you are doing something truly worthwhile, it gets over before you know what happened. Only if you are doing something worthless, it feels like a long life. Have you noticed this? On a particular day when you were very happy, 24 hours went off like a moment. If you are miserable, 24 hours feels like ten years.&nbsp;</p><p class=\"ql-align-right\">If you are doing something truly worthwhile, it gets over before you know what happened. Only if you are doing something worthless, it feels like a long life.</p><p>One thing that every young person should do is, you must stay by yourself at least for two or three days without the influence of your peers, professors or parents and look at what you want to invest this&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/video/the-most-precious-gift\" target=\"_blank\">precious life</a>&nbsp;into. However big or small, it does not matter. If you see that something is truly worthwhile and you invest your life in that, this will be a life of fulfillment.</p><p><br></p><p>Editor's Note: The route to wellbeing doesn’t always seem clear cut to many people. What is the best course to take in your particular situation?&nbsp;<a href=\"https://isha.sadhguru.org/wisdom/audio/deciding-what-to-do\" target=\"_blank\">Listen to this podcast</a>&nbsp;from Sadhguru and find out.</p><p><br></p>"
        },
        "author_eid": "e1253e86-70e3-4880-857e-14122e83c772",
        "fields": {
            "tag": "news"
        },
        "notify": "false",
        "status": "published",
        "links": [],
        "custom_module_eid": "4c910efb-0693-4e2b-aaab-916b12dc4108",
        "__v": 0,
        "_active": true,
        "updated_at": "2018-11-03T18:32:34.813Z",
        "created_at": "2018-11-03T18:32:34.734Z"
    }
]